hw4/app/controllers/movies_controller.rb

  def same_director
    @movie = Movie.find(params[:id])
    @movies = Movie.where(:director => @movie.director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]